Tekla Open API Reference for Tekla Structures 2025
WpfBoltCatalogSize Class
 The WPFBoltCatalogSize class represents a control to select the bolt size using the bolt catalog.
 Bolt catalog controls always need to be in pairs, meaning in every dialog there has to be a WpfBoltCatalogStandard and a WpfBoltCatalogSize control.
Inheritance Hierarchy
System.Object
 System.Windows.Threading.DispatcherObject
 System.Windows.DependencyObject
 System.Windows.Media.Visual
 System.Windows.UIElement
 System.Windows.FrameworkElement
 System.Windows.Controls.Control
 System.Windows.Controls.ItemsControl
 System.Windows.Controls.Primitives.Selector
 System.Windows.Controls.ComboBox
 Tekla.Structures.Dialog.UIControls.WpfBoltCatalogSize
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class WpfBoltCatalogSize : ComboBox
Public Class WpfBoltCatalogSize
	Inherits ComboBox
The WpfBoltCatalogSize type exposes the following members.
Constructors
Name | Description
WpfBoltCatalogSize
 Initiates a new instance of the control.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace